<img src="images/usm.png" width="480" height="240" align="left"/>

# MAT281 - 2° Semestre 2019
## Aplicaciones de la Matemática en la Ingeniería

EL siguiente laboratorio debe realizarse de manera individual. No es posible copiar y pegar código de otros estudiantes. 
Pueden consultar internet (stackoverflow, por ejemplo), pero deben indicar sus fuentes cuando corresponda.

**Nombre**: *Juan Fco. Briceño Figueroa*

**Rol**: *201510522-7*

## Objetivos del laboratorio

* Reforzar conceptos básicos de la librería pandas.

## Contenidos

* [Problema 01](#p1)

<a id='p1'></a>
## I.- Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [1]:
import pandas as pd
import os

# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:
1. ¿Cuál es el número de observaciones en el conjunto de datos?
2. ¿Cuál es el número de columnas en el conjunto de datos?
3. Imprime el nombre de todas las columnas
4. ¿Cómo se indexa el conjunto de datos?
5. ¿Cuál es el tipo de datos de cada columna?
6. Resumir el conjunto de datos (**Hint**: pd.describe())
7. Resume todas las columnas (**Hint**: pd.describe(all))
8. Imprimir solo la columna de ocupación
9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?
10. ¿Cuál es la ocupación más frecuente?
11. ¿Cuál es la edad media de los usuarios?
12. ¿Cuál es la edad con menos ocurrencia?

In [2]:
#Pregunta 1
df['user_id'].nunique()

943

In [3]:
#Pregunta 2
df.shape #es posible ver con este comando que son 5 columnas y 943 filas

(943, 5)

In [4]:
#Pregunta 3
print(list(df.columns))

['user_id', 'age', 'gender', 'occupation', 'zip_code']

In [ ]:
#Pregunta 4
R: El conjunto de datos se indexa mediante una llave primaria que es la que nos entrega la columna user_id. Sin embargo el programa 
que utilizamos, les asigna un  valor igual al que se tiene en una lista ( lista de python) es decir que se inicializa con un 0 hasta 942 en este caso.

In [5]:
#Pregunta 5
#R: Es posible notar que user_id= Int , age= Int , gender=Str, ocupation: Str y Zip_code=Int
    
#Para comprobar esto utilizaremos 
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [6]:
#Pregunta 6
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [9]:
#Pregunta 7
df.describe(include = 'all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

In [10]:
#Pregunta 8
print(df['occupation'])

0         technician
1              other
2             writer
3         technician
4              other
5          executive
6      administrator
7      administrator
8            student
9             lawyer
10             other
11             other
12          educator
13         scientist
14          educator
15     entertainment
16        programmer
17             other
18         librarian
19         homemaker
20            writer
21            writer
22            artist
23            artist
24          engineer
25          engineer
26         librarian
27            writer
28        programmer
29           student
           ...
913            other
914    entertainment
915         engineer
916          student
917        scientist
918            other
919           artist
920          student
921    administrator
922          student
923            other
924         salesman
925    entertainment
926       programmer
927          student
928        scientist
929        scientist
930         educator
931         educator
932          student
933         engineer
934           doctor
935            other
936         educator
937       technician
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [11]:
#Preunta 9
df['occupation'].nunique()

21

In [ ]:
#Pregunta 10
R:Utilizando los datos entregados por la pregunta 7 es posible ver que la ocupacion es Student

In [ ]:
#Pregunta 11
R:Nuevamente utilizando los datos entregados por la tabla resumen (pregunta 7) es porsible ver que el promedio es 34.051962

In [22]:
#Pregunta 12
df.nsmallest(1,'age')

#R: Con este comando podemos encontrar al sujeto con la edad menos ocurrencia. 
# Esta funcion fue sacada de: https://www.geeksforgeeks.org › python-pandas-dataframe-nsmallest

    user_id  age gender occupation zip_code
29       30    7      M    student    55436